app/views/photos/_form.html.erb

    <div class="form-group">
    <%= f.input :theme_tokens, :input_html => {data: {load: @photo.theme_tags.map {|t| {id: t,name: t}}   }} %>
---
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'exit' OR lower(name) = 'news' OR lower(name) = 'good' OR lower(name) = 'окраина')