app/controllers/novelties_controller.rb

  def index
    # @novelties = Novelty.all
    @novelties = Novelty.paginate(:page => params[:page])
---
SELECT "novelties".* FROM "novelties" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "novelties"

  def create
    @novelty = Novelty.new(novelty_params)
    @novelty.user = current_user

    respond_to do |format|
      if @novelty.save
---
INSERT INTO "novelties" ("content", "created_at", "publish_date", "published", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @novelty.destroy
---
DELETE FROM "novelties" WHERE "novelties"."id" = $1  [["id", 3]]

    def set_novelty
      @novelty = Novelty.find(params[:id])
---
SELECT "novelties".* FROM "novelties" WHERE "novelties"."id" = $1 LIMIT 1  [["id", "3"]]