app/controllers/photo_ajax_controller.rb

  def theme_tokens
  	respond_to do |format|



  		tags = Photo.tag_counts_on(:themes).where("name like ?",["%#{params[:q]}%"])
  		tags = tags.map {|tag| {id: tag.id,name: tag.name} }
---
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN photos ON photos.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Photo' AND taggings.context = 'themes') AND (taggings.taggable_id IN(11,9,8)) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id WHERE (name like 'port%')
SELECT photos.id FROM "photos"