app/controllers/photos_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
SELECT "photos".* FROM "photos"
---
  def index
    @user = User.friendly.find(params[:user_id])
    @photos = @user.photos.load.paginate(:page => params[:page],per_page: 8)

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
  def edit
    @user = User.friendly.find(params[:user_id])

INSERT INTO "photos" ("created_at", "image", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 21 Aug 2013 06:17:36 UTC +00:00], ["image", "nadya5.jpg"], ["title", "My first"], ["updated_at", Wed, 21 Aug 2013 06:17:36 UTC +00:00], ["user_id", 4]]
---
  def create

    @photo = Photo.new(photo_params, current_user.id, true)
    authorize! :create, @photo #manualy authorize

    respond_to do |format|


      if @photo.save

UPDATE "photos" SET "topic_id" = $1, "updated_at" = $2 WHERE "photos"."id" = 11  [["topic_id", 1], ["updated_at", Thu, 22 Aug 2013 09:01:43 UTC +00:00]]
---
  def update
    # render text: params.inspect
    respond_to do |format|
      if @photo.update(photo_params)

DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 2]]
---
  def destroy

    respond_to do |format|
      if @photo.destroy

SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "7"]]
---
    def set_photo
      @photo = Photo.friendly.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
    def set_user
      @user = User.friendly.find(params[:user_id])