app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
  def index
    @topics = Topic.all

INSERT INTO "topics" ("content", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", ""], ["created_at", Thu, 22 Aug 2013 08:43:55 UTC +00:00], ["name", "Портрет"], ["updated_at", Thu, 22 Aug 2013 08:43:55 UTC +00:00]]
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_topic
      @topic = Topic.find(params[:id])