app/controllers/users_controller.rb

SELECT "users".* FROM "users"
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1 ORDER BY "roles"."id" ASC LIMIT 1  [["user_id", 4]]
SELECT "roles".* FROM "roles"
---
  def index

    authorize! :index, @user, :message => I18n.t(:access_denied)
    role_id = params[:users][:role_id] if params[:users]

    @users =
    if params[:users] && !role_id.blank?
      User.includes(:roles).where(roles: {id: role_id })
    elsif params[:users]
      User.where.not(id: User.includes(:roles).where(roles: {id: Role.pluck(:id) }).pluck(:id))
    else
      User.includes(:roles)

SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1
---
  def update
    authorize! :update, @user, :message => I18n.t(:access_denied)
    @user = User.friendly.find(params[:id])