app/controllers/user_profile_controller.rb

	def edit

    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 ORDER BY "users"."id" ASC LIMIT 1